# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's practice!

In [51]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [52]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
df.head(2) # specify number of rows from top

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [12]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

### **Info on unique values**

In [15]:
df['col2'].unique() # returns values for the col without repetitions

array([444, 555, 666], dtype=int64)

In [16]:
df.loc[1].unique() # works on rows too

array([2, 555, 'def'], dtype=object)

In [18]:
df['col2'].nunique() # number of unique values

3

In [20]:
df['col2'].value_counts() # counts number of repetitions

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [21]:
#Select from DataFrame using criteria from multiple columns
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### Applying functions

In [23]:
def squared(x):
    return x**2

In [25]:
df['col2'].apply(squared)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [26]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
df['col1'].sum()

10

**Permanently removing columns**

In [28]:
del df['col1']

In [29]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Get Column and Index Names**

In [34]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering Dataframes**

In [37]:
df.sort_values(by="col2") # -> not in place

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

**Find null values and Check for null values**

In [38]:
df.isnull() # replace with boolean

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [49]:
df.dropna() # drops rows with NaN values. specify axis for dropping columns

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [54]:
import numpy as np
df['col1'] = [np.nan, 3, np.nan, 5]

In [56]:
df

   col1  col2 col3
0   NaN   444  abc
1   3.0   555  def
2   NaN   666  ghi
3   5.0   444  xyz

In [58]:
df.fillna(-1)

   col1  col2 col3
0  -1.0   444  abc
1   3.0   555  def
2  -1.0   666  ghi
3   5.0   444  xyz

**Pivoting tables**

In [44]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [45]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [48]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# **Great Job!**